Управление_торговлей.ПБТ/src/Catalogs/вт_ВариантыПроизводстваПоТехКартам/вт_ВариантыПроизводстваПоТехКартам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вт_ВариантыПроизводстваПоТехКартам</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесДетали</name>
    <comment>Вес детали необработанной</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЛитника</name>
    <comment>Вес отходов обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатералЛитника</name>
    <comment>Материал отходов</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПроизводстваЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <comment>Плановая расчетная себестоимость</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаСебестоимость</name>
    <type>
      <types>EnumRef.вт_ВариантРасчетаПлановойСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписиСтоимости</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдИзм</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураБрака</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРецепта</name>
    <comment>Код ордера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведения</name>
    <comment>Дата введения рецепта</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокЗакладки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРецептов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>9</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПроцент</name>
      <comment>Если ИСТИНА, то поле Количество это проценты</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СписыватьПоВсегоИзготовлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная себестоимость</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСырья</name>
      <type>
        <types>CatalogRef.ВидыСырья</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Плановая расчетная цена</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентОтходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Неликвиды</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентЗакладки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Catalogs/вт_ВариантыПроизводстваПоТехКартам/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура СоздатьВыпускПродукцииНаСервере(ДокВыпуск)
	СтрокаТов = ДокВыпуск.Товары.Добавить();
	СтрокаТов.Номенклатура = Объект.Владелец;
	СтрокаТов.Характеристика = Объект.Характеристика;
	СтрокаТов.ВариантПроизводства = Объект.Ссылка;
	СтрокаТов.КоличествоПлан = объект.Количество;
	СтрокаТов.Количество = объект.Количество;
	
	СтрокаТов.КодСтроки = ДокВыпуск.Товары.Количество()+1;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыпускПродукции(Команда)
	П = Новый Структура("ЗаполнитьСырье",Истина);
	Форм = ПолучитьФорму("Документ.вт_ОтчетПроизводства.Форма.ФормаДокумента",П);
	ДанныеФормы = Форм.Объект;
	СоздатьВыпускПродукцииНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форм.Объект);
	Форм.открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Количество=1;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЕдИзм) Тогда
		Объект.ЕдИзм=Объект.Владелец.ЕдиницаИзмерения;
	КонецЕсли;
	ОбновитьКолонкиПризнаки();
	
	ВыборВремяПроизводства = ?(ЗначениеЗаполнено(Объект.ВремяПроизводстваСек),1,2);
	ВремяПроизводства      = ?(ЗначениеЗаполнено(Объект.ВремяПроизводстваСек),Объект.ВремяПроизводстваСек,Объект.ВремяПроизводстваЧас);
	
	Элементы.ДекорацияУпаковка.Заголовок = Объект.Владелец.УпаковкаПродукта;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКолонкиПризнаки()
	Для Каждого строкаСостав из Объект.Состав Цикл
		строкаСостав.ЕстьРецептура = вт_ОбщийМодульПроизводства.ПолучитьВариантПроизводстваПродукции(строкаСостав.Сырье,строкаСостав.Характеристика).Ссылка;
		строкаСостав.ЕстьВариантКомплектации = вт_ОбщийМодульПроизводства.ПолучитьВариантКомплектации(строкаСостав.Сырье).Ссылка;
		
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = Строка(Объект.Владелец) + " " + Строка(Объект.Характеристика) + " " + Строка(Объект.Количество);
КонецПроцедуры	

&НаСервере
Процедура СоздатьВыпускДляСписанияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВыпускДляСписания(Команда)
	П = Новый Структура("ЗаполнитьСырье, ОбнулитьКоличествоПродукции",Истина,Истина);
	Форм = ПолучитьФорму("Документ.вт_ОтчетПроизводства.Форма.ФормаДокумента",П);
	ДанныеФормы = Форм.Объект;
	СоздатьВыпускПродукцииНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форм.Объект);
	Форм.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	запрососновной = Новый Запрос("ВЫБРАТЬ
	|	вт_ВариантыПроизводстваПоТехКартам.Ссылка
	|ИЗ
	|	Справочник.вт_ВариантыПроизводстваПоТехКартам КАК вт_ВариантыПроизводстваПоТехКартам
	|ГДЕ
	|	вт_ВариантыПроизводстваПоТехКартам.Основной = ИСТИНА
	|	И вт_ВариантыПроизводстваПоТехКартам.Владелец = &Владелец
	|	И вт_ВариантыПроизводстваПоТехКартам.Ссылка <> &Ссылка");
	запрососновной.УстановитьПараметр("Владелец",Объект.Владелец);
	запрососновной.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Выборка = запрососновной.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда //Нет никаких рецептур основных
		ТекущийОбъект.Основной = Истина;
	ИначеЕсли НЕ Объект.Ссылка.Основной И ТекущийОбъект.Основной И 
		ТекущийОбъект.Характеристика = Выборка.Ссылка.Характеристика тогда
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.Основной = Ложь;
		Об.Записать();
	КонецЕсли;
	
	Если ВыборВремяПроизводства=1 Тогда
		Объект.ВремяПроизводстваСек = ВремяПроизводства;
		Объект.ВремяПроизводстваЧас = 0;
	ИначеЕсли ВыборВремяПроизводства=2 Тогда
		Объект.ВремяПроизводстваЧас = ВремяПроизводства;
		Объект.ВремяПроизводстваСек = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаКлиенте
Процедура СоставСырьеПриИзменении(Элемент)
	ОбновитьКолонкиПризнаки();
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.ВремяПроизводстваЧас = Объект.Операции.Итог("НормаВремени");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьСтруктуру(Команда)
	КомандаПоказатьСтруктуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПоказатьСтруктуруНаСервере()
	пДеревоПроизводства = РеквизитФормыВЗначение("ДеревоПроизводства");
	пДеревоПроизводства.Строки.Очистить();
	
	Справочники.вт_ВариантыПроизводстваПоТехКартам.ПостроитьДеревоПроизводства(пДеревоПроизводства.Строки,Объект.Ссылка, Строка(УникальныйИдентификатор));
	
	ЗначениеВРеквизитФормы(пДеревоПроизводства,"ДеревоПроизводства");
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасчетСебестоимости(Команда)
	КомандаРасчетСебестоимостиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаРасчетСебестоимостиНаСервере()
	ДеревоВыпуска = РеквизитФормыВЗначение("ДеревоПроизводства");
	
	Обр = Обработки.вт_РасчетыПлановойСебестоимости.Создать();
	МассивНоменклХарактеристик = Обр.ПолучитьНоменклатурыДерева(ДеревоВыпуска);
	ТаблицаЦен = Обр.ПолучитьЦеныПоВариантуРасчета(МассивНоменклХарактеристик, Организация, ТекущаяДата(),Объект.ВариантРасчетаСебестоимость);
	
	Обр.ЗаполнитьДеревоЦенами(ДеревоВыпуска, ТаблицаЦен);
	Обр.РасчетПромежуточныхВыпусковДерева(ДеревоВыпуска);
	ЗначениеВРеквизитФормы(ДеревоВыпуска,"ДеревоПроизводства");
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗаполнитьЦеныВариантаИзДерева(ДеревоВыпуска);
	Объект.Состав.Загрузить(Об.состав.Выгрузить());
	Объект.Стоимость = Об.Стоимость;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСебестоимостьНаСервере()
	ДеревоПр = РеквизитФормыВЗначение("ДеревоПроизводства");
	Об = РеквизитФормыВЗначение("Объект");
	
	Об.ЗаполнитьЦеныВариантаИзДерева(ДеревоПр);
	Объект.Состав.Загрузить(Об.состав.Выгрузить());
	Объект.Стоимость = Об.Стоимость;
	Объект.ДатаЗаписиСтоимости = ТекущаяДата();
	
	//Для каждого СтрокаДереваПр Из ДеревоПр.Строки Цикл
	//	Для каждого СтрокаСостава Из Об.Состав Цикл
	//		Если СтрокаСостава.Сырье = СтрокаДереваПр.Номенклатура
	//			И СтрокаСостава.Количество = СтрокаДереваПр.Количество Тогда
	//			СтрокаСостава.Цена  = СтрокаДереваПр.Цена;
	//			СтрокаСостава.Сумма = СтрокаДереваПр.Сумма;
	//			Прервать;
	//		КонецЕсли;	
	//	КонецЦикла;	
	//КонецЦикла;	
	ЗначениеВРеквизитФормы(Об, "Объект");	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСебестоимость(Команда)
	СохранитьСебестоимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВремяВыполнения()
	Если ВыборВремяПроизводства = 1 Тогда
		Объект.ВремяПроизводстваСек = ВремяПроизводства;
		Объект.ВремяПроизводстваЧас = 0;
	Иначе
		Объект.ВремяПроизводстваЧас = ВремяПроизводства; 
		Объект.ВремяПроизводстваСек = 0; 
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ВремяПроизводстваПриИзменении(Элемент)
	СохранитьВремяВыполнения();	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВремяПроизводстваПриИзменении(Элемент)
	СохранитьВремяВыполнения();	
КонецПроцедуры

&НаКлиенте
Процедура ОтходыКоличествоПриИзменении(Элемент)
//	ТекДанные = Элементы.Отходы.ТекущиеДанные;
//	ТекДанные.ПроцентОтходов = 0;
КонецПроцедуры

&НаКлиенте
Процедура ОтходыПроцентОтходовПриИзменении(Элемент)
	//ТекДанные = Элементы.Отходы.ТекущиеДанные;
	//ТекДанные.Количество = 0;
КонецПроцедуры

&НаКлиенте
Процедура СоставВидСырьяПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Состав.ТекущиеДанные;
	ТекущаяСтрока.Сырье = ПолучитьСырье(ТекущаяСтрока.ВидСырья);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСырье(ВидСырья)

	Возврат ВидСырья.ОсновнойАналог;

КонецФункции

&НаКлиенте
Процедура ДекорацияУпаковкаНажатие(Элемент)
	
	Упаковка = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Владелец, "УпаковкаПродукта");
	ОткрытьЗначение(Упаковка);
	
КонецПроцедуры
